Reports/СпискиРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>СпискиРаботниковОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаСНефиксированнымРабочимВременем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗоТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненийИзОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Работники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Работники</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаУвольнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостояниеРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостояниеРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостояниеРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостояниеРаботников</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановыеНачисленияРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеНачисленияРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачисленийРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУчетаВремениДляСредней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремениДляСредней</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Назначение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчетаИзмерение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОбъектовКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовКонтактнойИнформации</Name>
			<Comment>(Упр) Виды объектов контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
					<Comment>Справочник контрагентов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактныеЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическиеЛица</Name>
					<Comment>Справочник "Физические лица", контактные лица контрагентов, менеджеры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактныеЛицаКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеКонтакты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисныеЦентры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/СпискиРаботниковОрганизаций/Ext/ObjectModule.bsl
#Если Клиент Тогда
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности", ОбщийОтчет.ДатаКон);
	Если НЕ ЗначениеЗаполнено(ОбщийОтчет.ДатаКон) Тогда 
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Год", Год(РабочаяДата));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Месяц", Месяц(РабочаяДата));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_День", День(РабочаяДата));
	Иначе 
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Год", Год(ОбщийОтчет.ДатаКон));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Месяц", Месяц(ОбщийОтчет.ДатаКон));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_День", День(ОбщийОтчет.ДатаКон));
	КонецЕсли;
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Уволен", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Прием", Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Истина", Истина);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Ложь", Ложь);
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОбщийОтчет.ИмяРегистра = "-";
	ОбщийОтчет.мНазваниеОтчета = НСтр("ru='Списки работников организации';uk='Списки працівників організації'");
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	// структура представлений полей
	СтруктураПредставлениеПолей = Новый Структура();
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаботникиОрганизации.ФизЛицо КАК ФизЛицо
	|	//ДОПОЛНИТЕЛЬНЫЕ ПОЛЯ
	|
	|{ВЫБРАТЬ
	|	// данные о работнике организации
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизации.Сотрудник.ФизЛицо	КАК ФизЛицо,
	|	РаботникиОрганизации.ПодразделениеОрганизации.* КАК ПодразделениеОрганизации,
	|	РаботникиОрганизации.ПодразделениеОрганизации.Владелец.* КАК Организация,
	|	РаботникиОрганизации.Должность.* КАК Должность,
	|	РаботникиОрганизации.ГрафикРаботы.* КАК ГрафикРаботы,
	|	РаботникиОрганизации.Организация.* КАК ГоловнаяОрганизация,
	|	РаботникиОрганизации.Сотрудник.Код КАК ТабельныйНомер,
	|	РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	РаботникиОрганизации.ПодразделениеУпр.* КАК ПодразделениеУпр,
	|	РаботникиОрганизации.ДолжностьУпр.* КАК ДолжностьУпр,
	|	РаботникиОрганизации.ЗанимаемыхСтавокУпр КАК ЗанимаемыхСтавокУпр,
	|	РаботникиОрганизации.ГрафикРаботыУпр.* КАК ГрафикРаботыУпр,
	|	РаботникиОрганизации.Сотрудник.ПоНаправлениюОргановЗанятости КАК ПоНаправлениюОргановЗанятости,
	|	РаботникиОрганизации.ПринятНаНовоеРабочееМесто КАК ПринятНаНовоеРабочееМесто,
	|	ПриказыОПриеме.ДатаПриема КАК ДатаПриема,
	|	ПриказыОПриеме.ВидЗанятости КАК ВидЗанятости,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен
	|			ТОГДА РаботникиОрганизации.Период
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК ДатаУвольнения,
	|	ПлановыеНачисленияРаботниковСрез.ВидРасчета КАК ВидРасчета,
	|	ПлановыеНачисленияРаботниковСрез.Валюта1 КАК Валюта1,
	|	ПлановыеНачисленияРаботниковСрез.Валюта2 КАК Валюта2,
	|	ПлановыеНачисленияРаботниковСрез.Валюта3 КАК Валюта3,
	|	ПлановыеНачисленияРаботниковСрез.Показатель1 КАК Показатель1,
	|	ПлановыеНачисленияРаботниковСрез.Показатель2 КАК Показатель2,
	|	ПлановыеНачисленияРаботниковСрез.Показатель3 КАК Показатель3,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеОрганизации) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботниковОрганизации.Состояние 
	|	КОНЕЦ КАК Состояние,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияУпр = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботников.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеУпр) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботников.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботников.Состояние 
	|	КОНЕЦ КАК СостояниеУпр,
	|	ВЫБОР КОГДА (РаботникиОрганизации.ЗанимаемыхСтавок > 0) ИЛИ (РаботникиОрганизации.ЗанимаемыхСтавокУпр > 0)
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ ""Не работает"" 
	|	КОНЕЦ КАК СостояниеОбщ
	|	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
	|	//ДОПОЛНИТЕЛЬНЫЕ ПОЛЯ
	|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
	|	//СВОЙСТВА
	|}
	|
	|ИЗ
	|   (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|   ВЫБОР КОГДА НЕ (РаботникиОрганизации.Сотрудник ЕСТЬ NULL) 
	|	ТОГДА РаботникиОрганизации.Сотрудник
	|	ИНАЧЕ СотрудникиОрганизаций.Ссылка
	|   КОНЕЦ КАК Сотрудник,
	|   ВЫБОР КОГДА НЕ (РаботникиОрганизации.Сотрудник ЕСТЬ NULL) 
	|	ТОГДА РаботникиОрганизации.Сотрудник.ФизЛицо
	|	ИНАЧЕ СотрудникиОрганизаций.ФизЛицо
	|   КОНЕЦ КАК ФизЛицо,
	|	РаботникиОрганизации.Период КАК Период,
	|	РаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизации.ПодразделениеОрганизации.Владелец КАК Организация,
	|	РаботникиОрганизации.Должность КАК Должность,
	|	РаботникиОрганизации.ГрафикРаботы КАК ГрафикРаботы,
	|	РаботникиОрганизации.Организация КАК ГоловнаяОрганизация,
	|	РаботникиОрганизации.Сотрудник.Код КАК ТабельныйНомер,
	|	РаботникиОрганизации.ПричинаИзмененияСостояния КАК ПричинаИзмененияСостояния,
	|	РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	РаботникиОрганизации.Сотрудник.ПоНаправлениюОргановЗанятости КАК ПоНаправлениюОргановЗанятости,
	|	РаботникиОрганизации.ПринятНаНовоеРабочееМесто КАК ПринятНаНовоеРабочееМесто,
	|	Работники.Период КАК ПериодУпр,
	|	Работники.Подразделение КАК ПодразделениеУпр,
	|	Работники.Должность КАК ДолжностьУпр,
	|	Работники.ПричинаИзмененияСостояния КАК ПричинаИзмененияСостоянияУпр,
	|	Работники.ГрафикРаботы КАК ГрафикРаботыУпр,
	|	Работники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавокУпр
	|   ИЗ
    |	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности) КАК РаботникиОрганизации
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(&ДатаАктуальности) КАК Работники
	|		ПО РаботникиОрганизации.Сотрудник.ФизЛицо  = Работники.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ПО Работники.ФизЛицо = СотрудникиОрганизаций.ФизЛицо	) КАК РаботникиОрганизации
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаАктуальности) КАК СостояниеРаботниковОрганизации
	|		ПО РаботникиОрганизации.Сотрудник= СостояниеРаботниковОрганизации.Сотрудник И РаботникиОрганизации.Организация = СостояниеРаботниковОрганизации.Организация}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботников.СрезПоследних(&ДатаАктуальности) КАК СостояниеРаботников
	|		ПО РаботникиОрганизации.Сотрудник.ФизЛицо  = СостояниеРаботников.ФизЛицо}
	|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
	|		//КОНТАКТНАЯ ИНФОРМАЦИЯ: СОЕДИНЕНИЯ
	|		//СОЕДИНЕНИЯ
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ДатаАктуальности) КАК ПлановыеНачисленияРаботниковСрез
	|		ПО РаботникиОрганизации.Сотрудник  = ПлановыеНачисленияРаботниковСрез.Сотрудник И РаботникиОрганизации.Организация = ПлановыеНачисленияРаботниковСрез.Организация
	|		 И 	ПлановыеНачисленияРаботниковСрез.Актуальность = &Истина}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДатыПоследнихДвиженийРаботников.Период КАК ДатаПриема,
	|			ДатыПоследнихДвиженийРаботников.Организация,
	|			ДатыПоследнихДвиженийРаботников.Сотрудник				КАК Сотрудник,
	|			ДатыПоследнихДвиженийРаботников.Сотрудник.ФизЛицо		КАК ФизЛицо,
	|			ДанныеПоРаботникуПриНазначении.Сотрудник.ВидЗанятости КАК ВидЗанятости
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ТЧРаботникиОрганизации.Организация,
	|				МАКСИМУМ(Работники.Период) КАК Период,
	|				ТЧРаботникиОрганизации.Сотрудник КАК Сотрудник,
	|				ТЧРаботникиОрганизации.Сотрудник.ФизЛицо КАК ФизЛицо
	|			ИЗ
	|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности,) КАК ТЧРаботникиОрганизации
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
	|					ПО ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
	|						И ТЧРаботникиОрганизации.Организация = Работники.Организация
	|						И Работники.Период <= ТЧРаботникиОрганизации.Период
	|						И (Работники.ПричинаИзмененияСостояния = &Прием)
	|			{ГДЕ
	|				ТЧРаботникиОрганизации.Должность КАК Должность,
	|				ТЧРаботникиОрганизации.ГрафикРаботы КАК ГрафикРаботы,
	|				ТЧРаботникиОрганизации.Сотрудник		КАК Сотрудник,
	|				ТЧРаботникиОрганизации.Сотрудник.ФизЛицо КАК ФизЛицо,
	|				ТЧРаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|				ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец КАК ОбособленноеПодразделение,
	|				ТЧРаботникиОрганизации.ПодразделениеОрганизации КАК Подразделение}
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ТЧРаботникиОрганизации.Организация,
	|				ТЧРаботникиОрганизации.Сотрудник,
	|				ТЧРаботникиОрганизации.Сотрудник.ФизЛицо) КАК ДатыПоследнихДвиженийРаботников
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДанныеПоРаботникуПриНазначении
	|				ПО ДанныеПоРаботникуПриНазначении.Период = ДатыПоследнихДвиженийРаботников.Период
	|					И ДатыПоследнихДвиженийРаботников.Сотрудник = ДанныеПоРаботникуПриНазначении.Сотрудник
	|					И (ДатыПоследнихДвиженийРаботников.Организация = ДанныеПоРаботникуПриНазначении.Организация)) КАК ПриказыОПриеме
	|		ПО ПриказыОПриеме.Организация = РаботникиОрганизации.Организация
	|			И ПриказыОПриеме.Сотрудник = РаботникиОрганизации.Сотрудник}
	|
	|{ГДЕ
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизации.Сотрудник.ФизЛицо 	КАК ФизЛицо,
	|	РаботникиОрганизации.ПодразделениеОрганизации.* КАК ПодразделениеОрганизации,
	|	РаботникиОрганизации.ПодразделениеУпр.* КАК ПодразделениеУпр,
	|	РаботникиОрганизации.ПодразделениеОрганизации.Владелец.* КАК Организация,
	|	РаботникиОрганизации.Должность.* КАК Должность,
	|	РаботникиОрганизации.ДолжностьУпр.* КАК ДолжностьУпр,
	|	РаботникиОрганизации.ГрафикРаботы.* КАК ГрафикРаботы,
	|	РаботникиОрганизации.ГрафикРаботыУпр.* КАК ГрафикРаботыУпр,
	|	РаботникиОрганизации.Организация.* КАК ГоловнаяОрганизация,
	|	РаботникиОрганизации.Сотрудник.Код КАК ТабельныйНомер,
	|	РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	РаботникиОрганизации.ЗанимаемыхСтавокУпр КАК ЗанимаемыхСтавокУпр,
	|	РаботникиОрганизации.Сотрудник.ПоНаправлениюОргановЗанятости КАК ПоНаправлениюОргановЗанятости,
	|	РаботникиОрганизации.ПринятНаНовоеРабочееМесто КАК ПринятНаНовоеРабочееМесто,
	|	ПриказыОПриеме.ДатаПриема КАК ДатаПриема,
	|	ПриказыОПриеме.ВидЗанятости КАК ВидЗанятости,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен
	|			ТОГДА РаботникиОрганизации.Период
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК ДатаУвольнения,
	|	ПлановыеНачисленияРаботниковСрез.ВидРасчета КАК ВидРасчета,
	|	ПлановыеНачисленияРаботниковСрез.Валюта1 КАК Валюта1,
	|	ПлановыеНачисленияРаботниковСрез.Валюта2 КАК Валюта2,
	|	ПлановыеНачисленияРаботниковСрез.Валюта3 КАК Валюта3,
	|	ВЫБОР КОГДА (РаботникиОрганизации.ЗанимаемыхСтавок > 0) ИЛИ (РаботникиОрганизации.ЗанимаемыхСтавокУпр > 0)
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ ""Не работает"" 
	|	КОНЕЦ КАК СостояниеОбщ,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеОрганизации) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботниковОрганизации.Состояние 
	|	КОНЕЦ КАК Состояние,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияУпр = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботников.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеУпр) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботников.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботников.Состояние 
	|	КОНЕЦ КАК СостояниеУпр
	| 	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
	|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
	|	//СВОЙСТВА
	|	//КАТЕГОРИИ
	|}
	|
	|{УПОРЯДОЧИТЬ ПО
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизации.Сотрудник.ФизЛицо	КАК ФизЛицо,
	|	РаботникиОрганизации.ПодразделениеОрганизации.* КАК ПодразделениеОрганизации,
	|	РаботникиОрганизации.ПодразделениеУпр.* КАК ПодразделениеУпр,
	|	РаботникиОрганизации.ПодразделениеОрганизации.Владелец.* КАК Организация,
	|	РаботникиОрганизации.Должность.* КАК Должность,
	|	РаботникиОрганизации.ДолжностьУпр.* КАК ДолжностьУпр,
	|	РаботникиОрганизации.ГрафикРаботы.* КАК ГрафикРаботы,
	|	РаботникиОрганизации.ГрафикРаботыУпр.* КАК ГрафикРаботыУпр,
	|	РаботникиОрганизации.Организация.* КАК ГоловнаяОрганизация,
	|	РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	РаботникиОрганизации.ЗанимаемыхСтавокУпр КАК ЗанимаемыхСтавокУпр,
	|	РаботникиОрганизации.Сотрудник.Код КАК ТабельныйНомер,
	|	РаботникиОрганизации.Сотрудник.ПоНаправлениюОргановЗанятости КАК ПоНаправлениюОргановЗанятости,
	|	РаботникиОрганизации.ПринятНаНовоеРабочееМесто КАК ПринятНаНовоеРабочееМесто,
	|	ПриказыОПриеме.ВидЗанятости КАК ВидЗанятости,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен
	|			ТОГДА РаботникиОрганизации.Период
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК ДатаУвольнения,
	|	ПлановыеНачисленияРаботниковСрез.ВидРасчета КАК ВидРасчета,
	|	ПлановыеНачисленияРаботниковСрез.Валюта1 КАК Валюта1,
	|	ПлановыеНачисленияРаботниковСрез.Валюта2 КАК Валюта2,
	|	ПлановыеНачисленияРаботниковСрез.Валюта3 КАК Валюта3,
	|	ПлановыеНачисленияРаботниковСрез.Показатель1 КАК Показатель1,
	|	ПлановыеНачисленияРаботниковСрез.Показатель2 КАК Показатель2,
	|	ПлановыеНачисленияРаботниковСрез.Показатель3 КАК Показатель3,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеОрганизации) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботниковОрганизации.Состояние 
	|	КОНЕЦ КАК Состояние,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияУпр = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботников.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеУпр) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботников.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботников.Состояние 
	|	КОНЕЦ КАК СостояниеУпр,
	|	ВЫБОР КОГДА (РаботникиОрганизации.ЗанимаемыхСтавок > 0) ИЛИ (РаботникиОрганизации.ЗанимаемыхСтавокУпр > 0)
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ ""Не работает"" 
	|	КОНЕЦ КАК СостояниеОбщ
	| 	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
	|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
	|	//СВОЙСТВА
	|}
	|
	|ИТОГИ ПО ОБЩИЕ
	|
	|{ИТОГИ ПО
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизации.Сотрудник.ФизЛицо	КАК ФизЛицо,
	|	РаботникиОрганизации.ПодразделениеОрганизации.* КАК ПодразделениеОрганизации,
	|	РаботникиОрганизации.ПодразделениеУпр.* КАК ПодразделениеУпр,
	|	РаботникиОрганизации.ПодразделениеОрганизации.Владелец.* КАК Организация,
	|	РаботникиОрганизации.Должность.* КАК Должность,
	|	РаботникиОрганизации.ДолжностьУпр.* КАК ДолжностьУпр,
	|	РаботникиОрганизации.ГрафикРаботы.* КАК ГрафикРаботы,
	|	РаботникиОрганизации.ГрафикРаботыУпр.* КАК ГрафикРаботыУпр,
	|	РаботникиОрганизации.Организация.* КАК ГоловнаяОрганизация,
	|	РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	РаботникиОрганизации.ЗанимаемыхСтавокУпр КАК ЗанимаемыхСтавокУпр,
	|	РаботникиОрганизации.Сотрудник.ПоНаправлениюОргановЗанятости КАК ПоНаправлениюОргановЗанятости,
	|	РаботникиОрганизации.ПринятНаНовоеРабочееМесто КАК ПринятНаНовоеРабочееМесто,
	|	ПриказыОПриеме.ДатаПриема КАК ДатаПриема,
	|	ПриказыОПриеме.ВидЗанятости КАК ВидЗанятости,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен
	|			ТОГДА РаботникиОрганизации.Период
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК ДатаУвольнения,
	|	ПлановыеНачисленияРаботниковСрез.ВидРасчета КАК ВидРасчета,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеОрганизации) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботниковОрганизации.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботниковОрганизации.Состояние 
	|	КОНЕЦ КАК Состояние,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияУпр = &Уволен 
	|		  	ТОГДА ""Уволен"" 
	|		  КОГДА ((СостояниеРаботников.Состояние) ЕСТЬ NULL)И((РаботникиОрганизации.ПодразделениеУпр) ЕСТЬ NULL)  
	|			ТОГДА """" 
	|		  КОГДА (СостояниеРаботников.Состояние) ЕСТЬ NULL  
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ СостояниеРаботников.Состояние 
	|	КОНЕЦ КАК СостояниеУпр,
	|	ВЫБОР КОГДА (РаботникиОрганизации.ЗанимаемыхСтавок > 0) ИЛИ (РаботникиОрганизации.ЗанимаемыхСтавокУпр > 0)
	|			ТОГДА ""Работает"" 
	|		  ИНАЧЕ ""Не работает"" 
	|	КОНЕЦ КАК СостояниеОбщ
	| 	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
	|	//ДОПОЛНИТЕЛЬНЫЕ ПСЕВДОНИМЫ ПОЛЕЙ
	|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
	|	//СВОЙСТВА
	|}";

	УправлениеОтчетами.ДобавитьВТекстПостроителяИнтервальныеГруппировкиФизлиц(ТекстЗапроса, ОбщийОтчет.Интервалы, ПостроительОтчета.Параметры, ОбщийОтчет.СоответствиеТиповИнтервальныхПолей,СтруктураПредставлениеПолей,"РаботникиОрганизации.ФизЛицо");
	
	// Преобразуем текст запроса для получения полной информации о физлице
	УправлениеОтчетами.ДобавитьВТекстПостроителяДанныеОФизлице(ТекстЗапроса, СтруктураПредставлениеПолей, ОбщийОтчет.СтруктураФорматаПолей, "РаботникиОрганизации");	
	
	// Таблица описания видов объектов контактной информации для возможности вывода в отчет
	ТаблицаВидовОбъектовКИ = Новый ТаблицаЗначений;
	ТаблицаВидовОбъектовКИ.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляется контактная информация
	ТаблицаВидовОбъектовКИ.Колонки.Добавить("Представление");// представление поля, для которого добавляется контактная информация
	ТаблицаВидовОбъектовКИ.Колонки.Добавить("ВидОбъекта");   // вид объекта-владельца контактной информации
	ТаблицаВидовОбъектовКИ.Колонки.Добавить("СтрокаТипОбъекта");   // тип объекта-владельца контактной информации
	
	НоваяСтрока = ТаблицаВидовОбъектовКИ.Добавить();
	НоваяСтрока.ПутьКДанным = "РаботникиОрганизации.Сотрудник.ФизЛицо";
	НоваяСтрока.Представление = "Работник";
	НоваяСтрока.ВидОбъекта = Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица;
	НоваяСтрока.СтрокаТипОбъекта = "Справочник.ФизическиеЛица";
	
	НоваяСтрока = ТаблицаВидовОбъектовКИ.Добавить();
	НоваяСтрока.ПутьКДанным = "РаботникиОрганизации.Организация";
	НоваяСтрока.Представление = "Организация";
	НоваяСтрока.ВидОбъекта = Перечисления.ВидыОбъектовКонтактнойИнформации.Организации;
	НоваяСтрока.СтрокаТипОбъекта = "Справочник.Организации";
	
	// Добавим строки запроса, необходимые для выборки контактной информации
	УправлениеОтчетами.ДобавитьВТекстПостроителяКонтактнуюИнформацию(ТаблицаВидовОбъектовКИ, ТекстЗапроса, СтруктураПредставлениеПолей, ОбщийОтчет.мСоответствиеНазначений, ОбщийОтчет.ПостроительОтчета.Параметры);

	// При использовании свойств и категорий в текст запроса добавляются дополнительные поля
	Если ОбщийОтчет.ИспользоватьСвойстваИКатегории Тогда

		// Свойства и категории, назначаемые пользователем:
		ТаблицаПолей = Новый ТаблицаЗначений;
		ТаблицаПолей.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляются свойства и категории. Используется в условии соединения с регистром сведений, хранящим значения свойств или категорий
		ТаблицаПолей.Колонки.Добавить("Представление");// представление поля, для которого добавляются свойства и категории. 
		ТаблицаПолей.Колонки.Добавить("Назначение");   // назначение свойств/категорий объектов для данного поля
		ТаблицаПолей.Колонки.Добавить("ТипЗначения");  // тип значения поля, для которого добавляются свойства и категории. Используется, если не установлено назначение
		ТаблицаПолей.Колонки.Добавить("НетКатегорий"); // признак НЕиспользования категорий для объекта

		НоваяСтрока = ТаблицаПолей.Добавить();
		НоваяСтрока.ПутьКДанным = "РаботникиОрганизации.Сотрудник.ФизЛицо";
		НоваяСтрока.Представление = "Работник";
		НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ФизическиеЛица;

		// Добавим строки запроса, необходимые для использования свойств и категорий
		ТекстПоляКатегорий = "";
		ТекстПоляСвойств = "";

		УправлениеОтчетами.ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, 
				ОбщийОтчет.мСоответствиеНазначений, ПостроительОтчета.Параметры
				,, ТекстПоляКатегорий, ТекстПоляСвойств,,,,,,ОбщийОтчет.мСтруктураДляОтбораПоКатегориям);
		
	КонецЕсли;						  
	
	ПостроительОтчета.Текст = ТекстЗапроса;							  
	
	Если ОбщийОтчет.ИспользоватьСвойстваИКатегории = Истина Тогда
		УправлениеОтчетами.УстановитьТипыЗначенийСвойствИКатегорийДляОтбора(ПостроительОтчета, ТекстПоляКатегорий, ТекстПоляСвойств, ОбщийОтчет.мСоответствиеНазначений, СтруктураПредставлениеПолей);
	КонецЕсли;
							  
	//представление полей запроса
	СтруктураПредставлениеПолей.Вставить("ФизЛицо", НСтр("ru='Работник';uk='Працівник'"));
	СтруктураПредставлениеПолей.Вставить("ЗанимаемыхСтавок", НСтр("ru='Занято ставок (регл)';uk='Зайнято ставок (регл)'"));
	СтруктураПредставлениеПолей.Вставить("ВидЗанятости", НСтр("ru='Вид занятости';uk='Вид зайнятості'"));
	СтруктураПредставлениеПолей.Вставить("Состояние", НСтр("ru='Состояние (регл)';uk='Стан (регл)'"));
	СтруктураПредставлениеПолей.Вставить("ПодразделениеОрганизации", НСтр("ru='Подразделение (регл)';uk='Підрозділ (регл)'"));
	СтруктураПредставлениеПолей.Вставить("Должность", НСтр("ru='Должность (регл)';uk='Посада (регл)'"));
	СтруктураПредставлениеПолей.Вставить("ГоловнаяОрганизация", НСтр("ru='Головная организация';uk='Головна організація'"));
	СтруктураПредставлениеПолей.Вставить("ГрафикРаботы", НСтр("ru='График работы (регл)';uk='Графік роботи (регл)'"));
	СтруктураПредставлениеПолей.Вставить("ТабельныйНомер", НСтр("ru='Табельный номер (регл)';uk='Табельний номер (регл)'"));
	СтруктураПредставлениеПолей.Вставить("ПриказОПриеме", НСтр("ru='Приказ о приеме';uk='Наказ про прийом'"));
	СтруктураПредставлениеПолей.Вставить("ДатаПриема", НСтр("ru='Дата приема';uk='Дата прийому'"));
	СтруктураПредставлениеПолей.Вставить("ДатаУвольнения", НСтр("ru='Дата увольнения';uk='Дата звільнення'"));
	СтруктураПредставлениеПолей.Вставить("ПоНаправлениюОргановЗанятости", НСтр("ru='По направлению органов занятости';uk='За направленням органів зайнятості'"));
	СтруктураПредставлениеПолей.Вставить("ПринятНаНовоеРабочееМесто", НСтр("ru='Принят на новое рабочее место';uk='Прийнятий на нове робоче місце'"));
	СтруктураПредставлениеПолей.Вставить("ВидРасчета", НСтр("ru='Начисление';uk='Нарахування'"));
	СтруктураПредставлениеПолей.Вставить("Показатель1", НСтр("ru='Показатель 1 начисления';uk='Показник 1 нарахування'"));
	СтруктураПредставлениеПолей.Вставить("Показатель2", НСтр("ru='Показатель 2 начисления';uk='Показник 2 нарахування'"));
	СтруктураПредставлениеПолей.Вставить("Показатель3", НСтр("ru='Показатель 3 начисления';uk='Показник 3 нарахування'"));
	
	СтруктураПредставлениеПолей.Вставить("ЗанимаемыхСтавокУпр", НСтр("ru='Занято ставок (упр)';uk='Зайнято ставок (упр)'"));
	СтруктураПредставлениеПолей.Вставить("ПодразделениеУпр", НСтр("ru='Подразделение (упр)';uk='Підрозділ (упр)'"));
	СтруктураПредставлениеПолей.Вставить("ДолжностьУпр", НСтр("ru='Должность (упр)';uk='Посада (упр)'"));
	СтруктураПредставлениеПолей.Вставить("ГрафикРаботыУпр", НСтр("ru='График работы (упр)';uk='Графік роботи (упр)'"));
	СтруктураПредставлениеПолей.Вставить("СостояниеУпр", НСтр("ru='Состояние (упр)';uk='Стан (упр)'"));
	СтруктураПредставлениеПолей.Вставить("СостояниеОбщ", НСтр("ru='Состояние';uk='Стан'"));
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	
	// ФОРМАТ ПОЛЕЙ
	ОбщийОтчет.СтруктураФорматаПолей.Вставить("ДатаПриема", "ДФ=dd.MM.yyyy");
	ОбщийОтчет.СтруктураФорматаПолей.Вставить("ДатаУвольнения", "ДФ=dd.MM.yyyy");
	
	// группировки по умолчанию
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Организация");
	ПостроительОтчета.ИзмеренияСтроки.Добавить("ПодразделениеОрганизации");
	
	// отборы по умолчанию
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Организация");
	МассивОтбора.Добавить("ПодразделениеОрганизации");
	МассивОтбора.Добавить("ПодразделениеУпр");
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	// отбор не уволенных
	ЭлементОтбора = ПостроительОтчета.Отбор.Добавить("ЗанимаемыхСтавок",,"Занимаемых ставок (регл)");
	ЭлементОтбора.ВидСравнения = ВидСравнения.Больше;
	ЭлементОтбора.Значение = 0;
	ЭлементОтбора = ПостроительОтчета.Отбор.Добавить("ЗанимаемыхСтавокУпр",,"Занимаемых ставок (упр)");
	ЭлементОтбора.ВидСравнения = ВидСравнения.Больше;
	ЭлементОтбора.Значение = 0;
	ЭлементОтбора = ПостроительОтчета.Отбор.Добавить("СостояниеОбщ",,"Состояние");
	ЭлементОтбора.ВидСравнения = ВидСравнения.Равно;
	ЭлементОтбора.Значение = "Работает";
	ЭлементОтбора.Использование = Истина;


		
	// поля по умолчанию
	ПостроительОтчета.ВыбранныеПоля.Очистить();
	ПостроительОтчета.ВыбранныеПоля.Добавить("ТабельныйНомер");
	ПостроительОтчета.ВыбранныеПоля.Добавить("ФиоПолное");
	
	// настройки отчета
	ОбщийОтчет.ИспользоватьИнтервальныеГруппировки = Истина;
	ОбщийОтчет.РаскрашиватьИзмерения = Истина;
	ОбщийОтчет.ВыводитьИтогиПоВсемУровням = Истина;
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
	ОбщийОтчет.мРежимВводаПериода = 1; // Дата
	
КонецПроцедуры

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет = ЭтотОбъект;
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()


// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет = Неопределено) Экспорт
	
	// Если отчет, вызвавший процедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
КонецПроцедуры
#КонецЕсли
